In [1]:
import pandas as pd

---

## 학원

## 데이터 불러오기

In [3]:
acad = pd.read_csv('./data/학원.csv', encoding='cp949')
acad.head()

            학원명         위도          경도
0       괴정수재독서실  36.338972  127.378925
1       지사푸르넷학원  35.150415  128.832045
2       제이엠무용학원  35.150415  128.832045
3  더배움영수굿모닝미술학원  35.149506  128.832611
4      삼성영어수학학원  35.150365  128.834072

In [6]:
acad.count()

학원명    4626
위도     4624
경도     4624
dtype: int64

In [8]:
lon_acad = acad.drop_duplicates(['위도','경도'])

In [9]:
lon_acad.count()

학원명    2835
위도     2834
경도     2834
dtype: int64

In [15]:
학원만 = lon_acad[~lon_acad['학원명'].str.contains("독서실")]

In [16]:
학원만.count()

학원명    2654
위도     2653
경도     2653
dtype: int64

In [17]:
학원만.to_csv('학원.csv', index=False, encoding='cp949')

---

## CCTV

In [18]:
cctv = pd.read_csv('./data/CCTV.csv', encoding='cp949')
cctv.head()

     NAME          경도         위도
0    대티방면  128.993807  35.100360
1  부산시청방면  129.059652  35.158357
2    대연방면  129.104919  35.139667
3    과정방면  129.085197  35.188835
4   새연산방면  129.084615  35.188840

In [19]:
cctv.count()

NAME    226
경도      226
위도      226
dtype: int64

In [21]:
lon_cctv = cctv.drop_duplicates(['위도'])
lon_cctv.count()

NAME    226
경도      226
위도      226
dtype: int64

---

## 학교

In [22]:
school = pd.read_csv('./data/초등학교,유치원.csv', encoding='cp949')
school.head()

     NAME         위도          경도
0  감천초등학교  35.083096  129.007605
1  광일초등학교  35.103725  129.029861
2  괴정초등학교  35.103763  128.999875
3  구덕초등학교  35.120262  129.012359
4  구평초등학교  35.087007  128.989239

In [23]:
school.count()

NAME    716
위도      716
경도      716
dtype: int64

In [25]:
lon_school = school.drop_duplicates(['경도'])
lon_school.count()

NAME    663
위도      663
경도      663
dtype: int64

In [26]:
lon_school.to_csv('./data/초등학교,유치원.csv', index=False, encoding='cp949')

---

## 공원

In [27]:
park = pd.read_csv('./data/공원.csv', encoding='cp949')
park.head()

    공원명         위도          경도
0  희망공원  35.253288  129.213168
1  희망공원  35.197702  129.133429
2  희망공원  35.174071  129.102578
3  희망공원  35.226661  129.009744
4  희망공원  35.106979  128.972764

In [28]:
park.count()

공원명    667
위도     667
경도     667
dtype: int64

In [29]:
lon_park = park.drop_duplicates(['위도'])
lon_park.count()

공원명    636
위도     636
경도     636
dtype: int64

In [30]:
lon_park.to_csv('./data/공원.csv', index=False, encoding='cp949')

---

## 어린이 사고다발지

In [32]:
many = pd.read_csv('./data/어린이사고다발지.csv', encoding='cp949')
many.head()

                         지점명          경도         위도
0   부산광역시 중구 대청동1가(대청사거리 부근)  129.027405  35.102976
1  부산광역시 영도구 청학동(동성알미늄샤시 부근)  129.065301  35.092408
2   부산광역시 동래구 복천동(대명아카데미 부근)  129.090660  35.203132
3   부산광역시 남구 용호동(LG메트로시티 부근)  129.113059  35.129353
4  부산광역시 북구 화명동(롯데드림어린이집 부근)  129.013631  35.236114

In [33]:
many.count()

지점명    91
경도     91
위도     91
dtype: int64

In [34]:
lon_many = many.drop_duplicates(['위도'])
lon_many.count()

지점명    91
경도     91
위도     91
dtype: int64